simulation/case_1/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    board
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    frontAndBack
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    outlet
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
