simulation/case_1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

x_min 9.0;
x_max 275;  

y_min 0.0;
y_max 225.0;

z_min 0.0;
z_max 15.0;

vertices
(
    ($x_min  $y_min $z_min)
    ($x_max  $y_min $z_min)
    ($x_max  $y_max $z_min)
    ($x_min  $y_max $z_min)
    ($x_min  $y_min $z_max)
    ($x_max  $y_min $z_max)
    ($x_max  $y_max $z_max)
    ($x_min  $y_max $z_max)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (55 45 3) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
